---
kind: method
id: M:Autodesk.Revit.DB.MullionTypeSetIterator.#ctor
source: html/26ea0f15-ce14-a00f-902b-36263669bb87.htm
---
# Autodesk.Revit.DB.MullionTypeSetIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public MullionTypeSetIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.